//Hunt for Defender tampering attempts

DeviceRegistryEvents 
| where (RegistryKey == "HKCU\Software\Microsoft\Office\16.0\Outlook\WebView\Inbox") or


((Property1:Value OR Property2:Value) AND (Property3:Value AND Property4:Value))


| where RegistryValueName == "DisableAntiSpyware" 
| where RegistryValueType == "Dword" 
| where RegistryValueData == 1 
| where IsInitiatingProcessRemoteSession == true 
