//Detecting Outlook Homepage Attacks - REQUIRES TESTING!!!
let HomePageReg = dynamic(["HKCU\\\\Software\\\\Microsoft\\\\Office\\\\16.0\\\\Outlook\\WebView\\\\Inbox", "HKCU\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Calendar", "HKCU\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Contacts", "HKCU\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Deleted Items", "HKCU\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Drafts", "HKCU\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Journal", "HKCU\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Junk E-mail", "HKCU\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Notes", "HKCU\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Outbox", "HKCU\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\RSS", "HKCU\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Sent Mail", "HKCU\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Tasks", "HKCU\\Software\\Microsoft\\Office\\16.0\\Outlook\\Today", "HKCU\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Inbox", "HKCU\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Calendar", "HKCU\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Contacts", "HKCU\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Deleted Items", "HKCU\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Drafts", "HKCU\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Journal", "HKCU\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Junk E-mail", "HKCU\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Notes", "HKCU\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Sent Mail", "HKCU\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Outbox", "HKCU\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\RSS", "HKCU\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Tasks", "HKCU\\Software\\Microsoft\\Office\\15.0\\Outlook\\Today", "HKCU\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Inbox", "HKCU\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Calendar", "HKCU\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Contacts", "HKCU\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Deleted Items", "HKCU\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Drafts", "HKCU\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Journal", "HKCU\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Junk E-mail", "HKCU\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Notes", "HKCU\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Outbox", "HKCU\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\RSS", "HKCU\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Sent Mail", "HKCU\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Tasks", "HKCU\\Software\\Microsoft\\Office\\14.0\\Outlook\\Today"]);
DeviceRegistryEvents
| where RegistryKey in~ (HomePageReg)
| where RegistryValueName matches regex "(http(s)?:\\//\\//.)?(www\\.)?[-a-zA-Z0-9@:%._\\+~#=]{2,256}\\.[a-z]{2,6}\\b([-a-zA-Z0-9@:%_\\+.~#?&////=]*)" 
